InformationRegisters/__СостоянияСообщенийПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СостоянияСообщенийПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__СостоянияУведомленийДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СостоянияУведомленийДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполненн</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__СообщенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СообщенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

WebServices/Users/Ext/Module.bsl
Функция ПолучитьСобытия(Сеанс)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Сеанс));
	
	// Получение данных.
	Реузльтат = Новый Структура("Сообщения,События",
		РегистрыСведений.__СостоянияСообщенийПользователей.ПолучитьСообщения(),
		РегистрыСведений.__СостоянияУведомленийДокументов.ПолучитьУведомления());
		
	// Результат.
	Возврат __В(Реузльтат);
	
КонецФункции // ПолучитьСобытия()

Функция ПодтвердитьСообщение(Сеанс, Сообщение)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Сеанс));
	
	// Изменение данных.
	РегистрыСведений.__СостоянияСообщенийПользователей.ПодтвердитьСообщение(__Из(Сообщение));
	Возврат Истина;
	
КонецФункции // ПодтвердитьСообщение()

Функция ПодтвердитьУведомление(Сеанс, Документ)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Сеанс));
	
	// Изменение данных.
	РегистрыСведений.__СостоянияУведомленийДокументов.ПодтвердитьУведомление(__Из(Документ));
	Возврат Истина;
	
КонецФункции // ПодтвердитьУведомление()

Функция ПолучитьПолучателейСообщения(Сеанс)
	
	// Продление сеанса.
	__ВебСервисСервер.ПродлениеСеанса(__Из(Сеанс));
	
	// Получение данных.
	Реузльтат = Новый Структура("Получатели,Сообщения",
		РегистрыСведений.__СообщенияПользователей.ПолучитьПолучателей(),
		РегистрыСведений.__СообщенияПользователей.ПолучитьСообщения());
		
	// Результат.
	Возврат __В(Реузльтат);
	
КонецФункции // ПолучитьПолучателейСообщения()

Функция ОтправитьСообщение(Сеанс, Получатель, Документ, Сообщение)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Сеанс));
	
	// Сообщить.
	РегистрыСведений.__СостоянияСообщенийПользователей.ДобавитьСообщение(__Из(Получатель), __Из(Документ, Истина), Сообщение);
	Возврат Истина;
	
КонецФункции // ОтправитьСообщение()

Функция SendMessage(Session, Receiver, Document, Message)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Session));
	
	// Сообщить.
	РегистрыСведений.__СостоянияСообщенийПользователей.ДобавитьСообщение(__Из(Receiver), __Из(Document, Истина), Message);
	
	Возврат Истина;
	
КонецФункции

Функция ConfirmMessage(Session, Message)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Session));
	
	// Изменение данных.
	РегистрыСведений.__СостоянияСообщенийПользователей.ПодтвердитьСообщение(__Из(Message));
	
	Возврат Истина;
	
КонецФункции

Функция GetMessageReceivers(Session)
	
	// Продление сеанса.
	__ВебСервисСервер.ПродлениеСеанса(__Из(Session));
	
	// Получение данных.
	Реузльтат = Новый Структура("Получатели, Сообщения", РегистрыСведений.__СообщенияПользователей.ПолучитьПолучателей(), РегистрыСведений.__СообщенияПользователей.ПолучитьСообщения());
	
	// Результат.
	Возврат __В(Реузльтат);
	
КонецФункции

Функция ConfirmNotification(Session, Document)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Session));
	
	// Изменение данных.
	РегистрыСведений.__СостоянияУведомленийДокументов.ПодтвердитьУведомление(__Из(Document));
	
	Возврат Истина;
	
КонецФункции

Функция GetEvents(Session)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Session));
	
	// Получение данных.
	Реузльтат = Новый Структура("Сообщения, События", РегистрыСведений.__СостоянияСообщенийПользователей.ПолучитьСообщения(), РегистрыСведений.__СостоянияУведомленийДокументов.ПолучитьУведомления());
	
	// Результат.
	Возврат __В(Реузльтат);
	
КонецФункции
